export const toolbar = {
    options: ['inline', 'blockType', 'fontSize', 'fontFamily', 'list', 'textAlign', 'colorPicker', 'link', 'emoji'],
    inline: {
      options: ['bold', 'italic', 'underline', 'strikethrough', 'monospace', 'superscript', 'subscript'],
    },
    blockType: {
      inDropdown: true,
      options: ['Normal', 'H1', 'H2', 'H3', 'H4', 'H5', 'H6', 'Blockquote', 'Code'],
    },
    fontSize: {
      options: [8, 9, 10, 11, 12, 14, 16, 18, 24, 30, 36, 48, 60, 72, 96],
    },
    fontFamily: {
      options: ['Arial', 'Georgia', 'Impact', 'Tahoma', 'Times New Roman', 'Verdana'],
    },
    list: {
      inDropdown: false,
      options: ['unordered', 'ordered', 'indent', 'outdent'],
    },
    textAlign: {
      inDropdown: false,
      options: ['left', 'center', 'right', 'justify'],
    },
    colorPicker: {
      colors: [ "#f9ebea", "#f5eef8", "#eaf2f8", "#e8f8f5", "#e9f7ef", "#fef9e7", "#fbeee6", "#eaecee",
        "#f2d7d5", "#ebdef0", "#d4e6f1", "#d1f2eb", "#d4efdf", "#fcf3cf", "#f6ddcc", "#d5d8dc",
        "#e6b0aa", "#d7bde2", "#a9cce3", "#a3e4d7", "#a9dfbf", "#f9e79f", "#edbb99", "#abb2b9",
        "#d98880", "#c39bd3", "#7fb3d5", "#76d7c4", "#7dcea0", "#f7dc6f", "#e59866", "#808b96",
        "#cd6155", "#af7ac5", "#5499c7", "#48c9b0", "#52be80", "#f4d03f", "#dc7633", "#566573",
        "#c0392b", "#9b59b6", "#2980b9", "#1abc9c", "#27ae60", "#f1c40f", "#d35400", "#2c3e50",
        "#a93226", "#884ea0", "#2471a3", "#17a589", "#229954", "#d4ac0d", "#ba4a00", "#273746",
        "#922b21", "#76448a", "#1f618d", "#148f77", "#1e8449", "#b7950b", "#a04000", "#212f3d",
        "#7b241c", "#633974", "#1a5276", "#117864", "#196f3d", "#9a7d0a", "#873600", "#1c2833",
        "#641e16", "#512e5f", "#154360", "#0e6251", "#145a32", "#7d6608", "#6e2c00", "#17202a",],
    },

    emoji: {
      emojis: [
        '😀', '😁', '😂', '😃', '😉', '😋', '😎', '😍', '😗', '🤗', '🤔', '😣', '😫', '😴', '😌', '🤓',
        '😛', '😜', '😠', '😇', '😷', '😈', '👻', '😺', '😸', '😹', '😻', '😼', '😽', '🙀', '🙈',
        '🙉', '🙊', '👼', '👮', '🕵', '💂', '👳', '🎅', '👸', '👰', '👲', '🙍', '🙇', '🚶', '🏃', '💃',
        '⛷', '🏂', '🏌', '🏄', '🚣', '🏊', '⛹', '🏋', '🚴', '👫', '💪', '👈', '👉', '👉', '👆', '🖕',
        '👇', '🖖', '🤘', '🖐', '👌', '👍', '👎', '✊', '👊', '👏', '🙌', '🙏', '🐵', '🐶', '🐇', '🐥',
        '🐸', '🐌', '🐛', '🐜', '🐝', '🍉', '🍄', '🍔', '🍤', '🍨', '🍪', '🎂', '🍰', '🍾', '🍷', '🍸',
        '🍺', '🌍', '🚑', '⏰', '🌙', '🌝', '🌞', '⭐', '🌟', '🌠', '🌨', '🌩', '⛄', '🔥', '🎄', '🎈',
        '🎉', '🎊', '🎁', '🎗', '🏀', '🏈', '🎲', '🔇', '🔈', '📣', '🔔', '🎵', '🎷', '💰', '🖊', '📅',
        '✅', '❎', '💯',
      ],
    },


  }